In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [6]:
# Base de datos en local
database_path = "northwind.db"

# Conexión a la base de datos
engine = sqlite3.connect(database_path)

# Crear un cursor
cursor = engine.cursor()

In [7]:
# Obtener todas las tablas en la base de datos
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Tablas en la base de datos:")
for table in tables:
    print(table[0])

Tablas en la base de datos:
Categories
sqlite_sequence
CustomerCustomerDemo
CustomerDemographics
Customers
Employees
EmployeeTerritories
Order Details
Orders
Products
Regions
Shippers
Suppliers
Territories

In [11]:
# Consulta: Muestra los nombres de las compañías de clientes que se encuentran en la ciudad de 'Berlin’.
query_1 = pd.read_sql("SELECT CompanyName FROM Customers WHERE City == 'Berlin'", engine)
query_1

           CompanyName
0  Alfreds Futterkiste

In [16]:
# Consulta: Muestra los nombres y apellidos de los empleados que trabajan en 'USA’.
query_2 = pd.read_sql("SELECT FirstName, LastName FROM Employees WHERE Country == 'USA'", engine)
query_2

  FirstName   LastName
0     Nancy    Davolio
1    Andrew     Fuller
2     Janet  Leverling
3  Margaret    Peacock
4     Laura   Callahan

In [32]:
#Consulta: Muestra el ID de los pedidos y el ID del cliente para cada pedido.
query_3 = pd.read_sql("SELECT Customers.CustomerID, Orders.OrderID FROM Customers "
                      "JOIN Orders "
                      "ON Customers.CustomerID = Orders.CustomerID", engine)
query_3

      CustomerID  OrderID
0          VINET    10248
1          TOMSP    10249
2          HANAR    10250
3          VICTE    10251
4          SUPRD    10252
...          ...      ...
16277      WHITC    26525
16278      WOLZA    26526
16279      GOURL    26527
16280      BLONP    26528
16281      DUMON    26529

[16282 rows x 2 columns]

In [ ]:
# Consulta: Muestra el nombre del producto y el nombre de la categoría para cada producto.